Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ལྷ་དང་མིའི་རིས་ཀྱི་ཕུན་སུམ་ཚོགས་པ་སྒྲུབ་པར་འགྱུར་བའི་བརྩོན་འགྲུས་ནི་དཔེར་ན་བརྒྱ་བྱིན་གྱིས་གསོལ་བ་བཏབ་པས། བྲམ་ཟེ་ཆེན་པོ་ཀིན་དུ་ཞེས་བྱ་བས་སེམས་ཅན་རྣམས་མཐོ་རིས་སུ་བཀྱེ་བ་གང་ཡིན་པ་དེ་ནི་ཕན་འདོགས་པས་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence dedicated through benefiting is diligence that accomplishes excellent circumstances in the realms of gods and humans, as exemplified by Kintu, the great brahmin, who at the request of Śakra delivered sentient beings to the higher realms.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་སངས་རྒྱས་ཀྱིས་ལེན་པ་མེད་པར་བསྒྲགས་པའི་བསམ་གཏན་ནི་དཔེར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྟོན་པར་གྱུར་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཚངས་པའི་འཇིག་རྟེན་དང་། འོད་གསལ་ནས་འདུ་ཤེས་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་བར་དུ་བཀོད་པ་གང་ཡིན་པ་དེ་ནི་ཕན་འདོགས་པས་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration dedicated through benefiting is a buddha’s concentration that communicates to the bodhisattvas without any grasping. For example, having become a teacher, the Bodhisattva manifested this concentration for the bodhisattvas in the Realm of Brahmā, and from the realm of Luminosity through to the sense field free from conception.

source: སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་བྱས་པ་ནི་དཔེར་ན་རྒྱལ་པོ་བྱམས་ཐོབ་དང་། རྒྱལ་པོ་མིག་བཟངས་དང་། རྒྱལ་པོའི་བུ་ཆོས་འདོད་ཀྱིས་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་རབ་ཏུ་སྒྲོགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། འདིར་སྐྱེས་པའི་རབས་མང་པོ་ནས་ཁོང་དུ་ཆུད་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་ཕན་འདོགས་པས་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight dedicated through benefiting is insight that for the benefit of sentient beings propounds the mundane and supramundane Dharma, as well as the ten virtuous courses of action, as exemplified by the kings Love Attainment and Sunetra, and also by Prince Dharmachanda. This can be understood from a great many accounts of the Bodhisattva’s former lives.

source: འདི་དག་ནི་ཕན་འདོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །།
en: Such are the six perfections of benefiting.

source: དེ་ལ་ཕན་མི་འདོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections without benefit?

source: ཡིད་སྔོན་དུ་འགྲོ་བའི་སེམས་ཀྱིས་འདོད་པའི་ཡོན་ཏན་ལ་འཇུག་པའི་སྦྱིན་པ་དམིགས་པ་དང་བཅས་པར་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་ཕན་མི་འདོགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། དཔེར་ན་མར་མེ་མཛད་ལ་མེ་ཏོག་ཨུད་པ་ལ་ལྔ་ཕུལ་བ་དང་། རྣམ་པར་སྨིན་པ་ཐམས་ཅད་དུ་མི་འབྱུང་བ་དང་། གང་དམ་པའི་ཆོས་ནུབ་པར་འགྱུར་བ་དེ་ནི་ཕན་མི་འདོགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity without benefit is generosity that involves apprehension as well as a preceding mental engagement in sense pleasures. This is what happened, for example, when five blue lotuses were offered to Dīpaṅkara—they were not in bloom, and so the sacred Dharma faded away.

source: ཐབས་མཁས་པ་མེད་ཅིང་དངོས་པོའི་འདུ་ཤེས་ཅན་གྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཕན་མི་འདོགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline without benefit is the perfection of discipline that lacks skillful means and involves notions of entities.

source: རོ་མྱང་བ་ཅུང་ཟད་ཙམ་གྱི་ཕྱིར། སྡུག་བསྔལ་ལ་ཇི་མི་སྙམ་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཕན་མི་འདོགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience without benefit is acceptance of suffering for the sake of even trivial enjoyment.

source: འཇིག་རྟེན་པའི་ཆོས་དང་རབ་ཏུ་ལྡན་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་ཕན་མི་འདོགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence without benefit is diligence that is laden with mundane concerns.

source: ཚངས་པའི་འཇིག་རྟེན་གྱི་ཚེའི་མཐས་གཏུགས་པ་སྲིད་ཀྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཕན་མི་འདོགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration without benefit is the concentration that endures only for as long as one lives in the Realm of Brahmā.

source: མ་བསྒྲགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དཔེར་ན་དེ་བཞིན་གཤེགས་པས་གསུངས་ཤིང་བཤད་པ་ན་ཆོས་དེ་སྙེད་ཅིག་བསྒྲགས་ཤིང་བཤད་ལ་ཆོས་ཇི་སྙེད་ལུས་ལ་དེ་སྙེད་ཅིག་མ་བསྒྲགས་པ་དེ་ནི་ཕན་མི་འདོགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight without benefit is the perfection of insight that is not made known. For example, when a thus-gone one teaches and explains, the teaching may be lost without being further transmitted.

source: དེ་དག་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དམ་པའི་ཆོས་ནུབ་པར་བལྟ་བར་བྱ་སྟེ། འདི་དག་ནི་ཕན་མི་འདོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections without benefit. These must all be regarded as the fading of the sacred Dharma of nirvāṇa.

source: དེ་ལ་ལྷག་མ་དང་བཅས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections with remainder?

source: སྔོན་མར་མེ་མཛད་ལ་བྱང་ཆུབ་སེམས་དཔའས་སྦྱིན་པ་ཕུལ་བ་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་དང་བཅས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity with remainder is generosity of the kind that the Bodhisattva offered to Dīpaṅkara in the past.

source: ལུས་དང་ངག་ལྷག་མ་དང་བཅས་ཤིང་མི་མོས་པ་མང་ལ་བདག་ཏུ་དམིགས་པ་ལ་གནས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་དང་བཅས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline with remainder is discipline that involves remainders of body and speech, great disinterest, and the observation of self.

source: སོ་སོར་བརྟགས་པའི་སྟོབས་ཀྱིས་ངེས་པར་འབྱུང་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་དང་བཅས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience with remainder is the patience of deliverance through the power of analysis.

source: བར་ཆད་དང་བར་ཆད་མེད་པར་གནས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་དང་བཅས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence with remainder is diligence that remains both interrupted and uninterrupted.

source: དམིགས་པ་ལ་དམིགས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་དང་བཅས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration with remainder is concentration that rests on objective references.

source: ཐོས་པའི་བདག་ཉིད་དང་། བསམ་པའི་བདག་ཉིད་ཀྱི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་དང་བཅས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of insight with remainder is insight based on hearing and contemplating.

source: རྒྱུ་གང་གིས་ན་གནས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མིང་ཐོབ་ཅེ་ན།
en: Why are these called ‘perfections with remainder’?

source: ཁ་ཕྱིར་ཕྱོགས་པ་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་རྣམ་པར་སྨིན་པ་མེད་ལ་བྱང་ཆུབ་ཀྱི་འབྱོར་པ་ཡང་མེད་དེ།
en: Because they are oriented outward, lack the ripening of the qualities of the hearers and solitary buddhas, and do not lead to awakening.

source: དེ་དག་ནི་ས་བཅུ་ལས་ལྡོག་པའི་ཆོས་སུ་ཤེས་པར་བྱ་སྟེ།
en: Hence, they should be known as factors that are averse to the ten spiritual levels.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་མ་དང་བཅས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections with remainder.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་མ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections without remainder?

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་འབྲས་བུ་ཐམས་ཅད་འཁོར་བར་ཡོངས་སུ་བསྔོ་བ་སྟེ། དཔེར་ན་རང་སངས་རྒྱས་བདུན་བརྒྱ་ལ་སྦྱིན་པ་བྱིན་པ་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity without remainder is generosity wherein ripening is dedicated to saṃsāra just as, for example, when offerings were made to seven hundred solitary buddhas.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline without remainder is discipline that is not separate from the perfection of insight.

source: ངན་སོང་དུ་སྐྱེ་བས་འཇིགས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་མེད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience without remainder is patience that involves fear of birth in the lower realms.

source: བདུད་ཀྱི་ལས་ཀྱིས་ཀུན་ནས་དཀྲིས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence without remainder is diligence in the midst of the māras’ activities.

source: ཚེའི་ཚད་ཀྱི་མཐར་ཐུག་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་མེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration without remainder is concentration that prevails as long as one is alive.

source: ལྟ་བ་སྔོན་དུ་འགྲོ་ཞིང་སྡུག་བསྔལ་སྤོང་བ་ལ་མོས་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ལྷག་མ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of insight without remainder precedes any view and is motivated by the wish to give up suffering.

source: དེ་ཅིའི་ཕྱིར་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མིང་ཐོབ་ཅེ་ན།
en: Why are these classified as perfections?

source: དེ་དག་ནི་བྱང་ཆུབ་ཐོབ་པ་འཇིག་རྟེན་པ་དང་འཐུན་པར་སྤྱོད་པ་དེས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མིང་ཐོབ་སྟེ།
en: Because they are practices for the attainment of awakening and because they accord with the world.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་མ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections without remainder.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་རིག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the bodhisattvas’ six perfections of intelligence?

source: བླ་མ་རྣམས་ལ་རེ་བ་མེད་པར་སྦྱིན་པ་བྱིན་པ་གང་གི་རྣམ་པར་སྨིན་པས་བསྐལ་པ་སྟོང་དུ་འཇིག་རྟེན་པའི་ཟང་ཟིང་ལ་ཡོངས་སུ་སྤྱོད་ཅིང་གནས་ཀྱང་ལུས་ཀྱི་མཐུ་ཉམས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་རིག་པ་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity dedicated to intelligence is generosity to masters without any expectation of reward. The ripening of such generosity provides mundane material goods for a thousand eons, and with respect to support, one’s physical strength will not degenerate.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དམ་པ་མཆོག་ཐོབ་པས་ཆོས་ཐམས་ཅད་ལ་འགྱོད་པ་མེད་པར་འགྱུར་ཞིང་། གང་གིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྫོགས་པར་བྱང་ཆུབ་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་རིག་པ་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline dedicated to intelligence is discipline that is free from regrets about any quality because one attains the true and supreme seat of awakening. This perfects the awakening to omniscience.

source: གང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་ཤིང་། དམིགས་སུ་མེད་པའི་ཆོས་རྣམས་ལ་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་རིག་པ་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience dedicated to intelligence is patience that is focused on omniscience and that accepts phenomena as nonapprehendable.

source: ལམ་ལ་གནས་པའི་སྒྲིབ་པ་ལྔ་རབ་ཏུ་ཞི་བར་འགྱུར་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་རིག་པ་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence dedicated to intelligence is diligence that quells the five obscurations in the context of being on the path.

source: བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས་ལྷའི་མིག་དང་། སྔོན་གྱི་གནས་རིག་པ་འཐོབ་པར་འགྱུར་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རིག་པ་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration dedicated to intelligence is concentration that attains the divine eye and knowledge of past lives through awakening to complete buddhahood.

source: ཟག་པ་ཟད་པར་བྱེད་པ་སངས་རྒྱས་ཀྱི་སྤྱན་འཐོབ་པར་འགྱུར་ལ་རྟག་ཏུ་ཆོས་ཐམས་ཅད་མངོན་དུ་སྣང་བར་འགྱུར་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་རིག་པ་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight dedicated to intelligence is insight that brings all contaminants to exhaustion and attains the buddha eye such that all phenomena are constantly evident.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་རིག་པ་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the bodhisattvas’ six perfections of intelligence.

source: དེ་ལ་རིག་པའི་ཁྱད་པར་ལ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of abiding by distinctive intelligence?

source: གང་གིས་དམ་པའི་ཆོས་གནས་པར་བྱེད་ཅིང་བསྟན་པ་ལ་འཇུག་པའི་ཆོས་གནས་པ་གང་ཡིན་པ་དེ་ནི་རིག་པའི་ཁྱད་པར་ལ་གནས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on abiding by distinctive intelligence is generosity that causes the sacred Dharma to endure and stabilizes the factors for engaging with the teachings.

source: གང་ན་དེ་བཞིན་གཤེགས་པ་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་དང་བྲལ་བ། ཐ་ན་ལུས་ཀྱི་རྣམ་པར་རྟོག་པ་དང་ངག་གི་རྣམ་པར་རྟོག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is a thus-gone one’s lack of connections to karmic imprints. It is free from even thoughts of body and speech.

source: འཇིག་རྟེན་པའི་ཆོས་ལ་རྟོག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the absence of thinking about worldly matters.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱིས་ཟིལ་གྱིས་མ་ནོན་པས་མྱ་ངན་ལས་འདས་པ་ཇི་སྲིད་པར་དུས་ཐམས་ཅད་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the endeavor that is constant through to nirvāṇa without becoming swayed by hearers or solitary buddhas.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྣམ་གྲངས་ཤེས་ཤིང་སྒྲ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration is knowledge of the categories of the minds of sentient beings and the understanding of their languages.

source: དུས་ཤེས་པ་ལས་མི་འདའ་ཞིང་བདག་ཡོངས་སུ་གྲོལ་བར་བྱེད་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་རིག་པའི་ཁྱད་པར་ལ་གནས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on abiding by distinctive intelligence is insight that remains aware of time and liberates one’s self.

source: འདི་དག་ནི་རིག་པའི་ཁྱད་པར་ལ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of abiding by distinctive intelligence.

source: དེ་ལ་སངས་རྒྱས་འབྱུང་བ་ཕུན་སུམ་ཚོགས་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the excellent appearance of a buddha?

source: སངས་རྒྱས་འབྱུང་བའི་དུས་ན་ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར་ཞིང་ཚད་མེད་པ་གཟུང་བའི་ཕྱིར། གང་འཕགས་པ་རྣམས་ལ་སྦྱིན་པ་བྱིན་པ་གང་ཡིན་པ་དེ་ནི་སངས་རྒྱས་འབྱུང་བ་ཕུན་སུམ་ཚོགས་པར་བྱེད་པའི་སྦྱིན་པའོ། །
en: The perfection of generosity of the excellent appearance of a buddha is the giving done by noble beings at the time they become buddhas in order that there may be great wealth and so that they may uphold the immeasurable qualities.

source: ཐར་བར་ཡོངས་སུ་བསྔོས་ཤིང་ཉོན་མོངས་པ་ཟད་པར་བྱ་བ་དང་། སངས་རྒྱས་འབྱུང་བར་འགྱུར་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline is the discipline that brings forth a buddha.

source: སྟོན་པ་མངོན་སུམ་དུ་གྱུར་པ་ན་སྦྱངས་པའི་ཡོན་ཏན་ལ་སྐྱོ་བ་མེད་པར་འགྱུར་བའི་བཟོད་པ་ནི་དཔེར་ན་འོད་སྲུང་ཆེན་པོའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the untiring acceptance of the ascetic virtues when the teacher is present, as exemplified by Mahākāśyapa.

source: སྨོན་ལམ་དང་ལྡན་པའི་བརྩོན་འགྲུས་ནི་དཔེར་ན་རྒྱལ་པོ་བསོད་ནམས་འཕགས་ཀྱི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence combined with aspiration prayers, as exemplified by the king Superior Merit.

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ལ་དམིགས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration that focuses on the recollection of the Buddha.

source: ངེས་པར་འབྱེད་པས་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ནི་དཔེར་ན། སངས་རྒྱས་འོད་སྲུང་གི་ཚེ་ལྔ་པོ་དག་གི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight dedicated to discernment, as exemplified by the five during the life of the Buddha Kāśyapa.

source: འདི་དག་ནི་སངས་རྒྱས་འབྱུང་བ་ཕུན་སུམ་ཚོགས་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the excellent appearance of a buddha.

source: དེ་ལ་དྲན་པ་ཉམས་པ་མེད་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that maintain recollection?

source: གཞན་གྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving in perfect accord with the wishes of others.

source: ལུས་དང་ངག་ཡོངས་སུ་བསྲུང་བ་ཉེ་བར་བསྒྲུབ་པ་ལ་བརྩོན་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of being guarded in body and speech.

source: དམ་པའི་ཆོས་ནུབ་པའི་དུས་སུ་ཡི་དམ་ལ་བརྟན་པ་ཟབ་མོ་ལ་བཟོད་པ་ལས་ངེས་པར་འབྱུང་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the acceptance of deliverance that occurs from accepting the profound and relying on one’s commitment at a time when the sacred Dharma is fading.

source: ཉེ་བར་བསྒྲུབ་པ་ལ་བརྩོན་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligence of endeavoring in accomplishment.

source: སྟོང་པ་ཉིད་ཀྱི་རྣམ་པས་ཡོངས་སུ་བཟུང་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration taken up with aspects of emptiness.

source: ཡིད་མི་བདེ་བས་རབ་ཏུ་ཕྱེ་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight that discriminates through what displeases the mind.

source: འདི་དག་ནི་དྲན་པ་ཉམས་པ་མེད་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that maintain recollection.

source: དེ་ལ་སངས་རྒྱས་འབྱུང་བ་རབ་ཏུ་འཐོབ་པ་ཁྱིམ་གྱི་དངོས་པོ་ལ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of abiding in the household that are receptive to a buddha’s appearance?

source: ཡན་ལག་ལྔ་ཕུན་སུམ་ཚོགས་པའི་སྦྱིན་པ་སྟེ་ལྔ་གང་ཞེ་ན། སྟན་ཕུན་སུམ་ཚོགས་པ་དང་། ཡུལ་ཕུན་སུམ་ཚོགས་པ་དང་། འཁོར་ཕུན་སུམ་ཚོགས་པ་དང་། འདོད་པར་བྱ་བ་ཕུན་སུམ་ཚོགས་པ་དང་། ཆགས་པར་བྱ་བ་ཕུན་སུམ་ཚོགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity consists of the five perfect aspects of giving: the giving of a perfect seat, perfect place, perfect retinue, perfect desirable objects, and perfect objects of attachment.

source: མངོན་པར་ཞེན་པ་མེད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is discipline without clinging.

source: སེམས་ཅན་དུ་འདུ་ཤེས་པ་སྤངས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of giving up the notion of a sentient being.

source: མཉམ་པ་ཉིད་དུ་མཐོང་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligence of seeing things in terms of equality.

source: མཉམ་པ་ཉིད་དུ་རྟོགས་པའི་སེམས་སྨོན་པ་མེད་པ་ལ་དམིགས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration of the mind that comprehends equality and apprehends the wishlessness.

source: འཕགས་པའི་བདེན་པའི་ཚུལ་གྱིས་ངེས་པར་འབྱུང་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight of deliverance by way of the truths of the noble ones.

source: འདི་དག་ནི་སངས་རྒྱས་འབྱུང་བ་རབ་ཏུ་འཐོབ་པ་ཁྱིམ་གྱི་དངོས་པོ་ལ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of abiding in the household that are receptive to a buddha’s appearance.

source: དེ་ལ་ངེས་པར་འབྱུང་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of accomplishing deliverance?

source: ཟག་པ་མེད་པའི་སྦྱིན་པ་དང་ལྡན་པ་མ་ཡིན་པའི་སེམས་ཀྱི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving in a mind not yet associated with undefiled giving.

source: མྱ་ངན་ལས་འདས་པ་དང་ལྡན་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is discipline imbued with nirvāṇa.

source: ཁམས་གསུམ་གྱིས་ཡིད་བྱུང་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of growing weary of the three realms.

source: དྲན་པ་ཉེ་བར་གཞག་པ་ལས་ངེས་པར་བྱུང་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligence of deliverance through the applications of mindfulness.

source: བྱམས་པ་ལ་གནས་ཤིང་སྲིད་པ་ལ་སྨོད་པར་གནས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration of abiding by love while disparaging existence.

source: འདི་དག་ནི་ངེས་པར་འབྱུང་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of accomplishing deliverance.

source: དེ་ལ་མང་དུ་ཐོས་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of accomplishing extensive learning?

source: གདམས་ངག་དང་ལྡན་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving endowed with practical instruction.

source: ཆོས་ཡོངས་སུ་གཟུང་བའི་དོན་དུ་ལུས་དང་སྲོག་གཏོང་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of giving up life and limb for the sake of embracing the Dharma.

source: དམ་པའི་ཆོས་ནུབ་པའི་དུས་ཀྱི་ཚེ་ཆོས་ཡོངས་སུ་གཟུང་བའི་དོན་དུ་གང་བྱང་ཆུབ་སེམས་དཔའ་བདག་ཉིད་ཡོངས་སུ་གཏོང་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of the bodhisattvas who at the time of the Dharma’s fading sacrifice themselves for the sake of comprehending the Dharma.

source: གཟུངས་དང་ལྡན་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence endowed with retention.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བས་རབ་ཏུ་ཕྱེ་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration that fully distinguishes dependent origination.

source: སོ་སོ་ཡང་དག་པར་རིག་པས་རབ་ཏུ་ཕྱེ་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight that fully distinguishes correct understanding.

source: འདི་དག་ནི་མང་དུ་ཐོས་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of accomplishing extensive learning.

source: དེ་ལ་རབ་ཏུ་བྱུང་བའི་ངང་ཚུལ་རྒྱུན་མི་འཆད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of continuously maintaining the appearance of having gone forth.

source: ཆོས་སྨྲ་བ་རྣམས་ཀྱིས་གཞན་གྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་བསྟན་པ་ཡང་དག་པར་ལེན་དུ་འཇུག་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is the generosity that is practiced by Dharma teachers who inspire others to adopt the teachings in accordance with each of their wishes.

source: སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་བསྒོས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is discipline imbued with great compassion.

source: ལྷག་པའི་ང་རྒྱལ་མེད་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is patience free from exaggerating pride.

source: བསྒོམས་པའི་སྟོབས་དང་ལྡན་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence imbued with the power of cultivation.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་མཚུངས་པར་ལྡན་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration that is associated with the factors of awakening.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་ལྡན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight endowed with the acceptance that phenomena are unborn.

source: འདི་དག་ནི་རབ་ཏུ་བྱུང་བའི་ངང་ཚུལ་རྒྱུན་མི་འཆད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of continuously maintaining the appearance of having gone forth.

source: དེ་ལ་མངོན་པར་ཤེས་པ་ལ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of abiding in superknowledges?

source: རྗེ་ས་དང་མ་བྲལ་ཞིང་སློང་བ་ལ་ཡོངས་སུ་གཏོང་བས་གཟུང་བའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving to beggars with respect.

source: མི་གནས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is nonabiding discipline.

source: འགྱོད་པ་མེད་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is patience free from regrets.

source: སྨོན་ལམ་གྱིས་རྣམ་པར་འཕྲུལ་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence displayed through aspiration prayers.

source: སྣང་བས་རྣམ་པར་དཔྱད་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration of examining things in terms of their appearing.

source: སྦྱོར་བའི་སའི་རྣམ་པ་ལ་དམིགས་པས་ལེགས་པར་ཡོངས་སུ་བཟུང་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight that properly understands by apprehending features of the level of application.

source: འདི་དག་ནི་མངོན་པར་ཤེས་པ་ལ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of abiding in superknowledges.

source: དེ་ལ་མངོན་པར་ཤེས་པ་རྒྱུན་ཆད་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of uninterrupted superknowledge?

source: དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དང་པོར་ཞལ་བསྲོ་བའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is the generosity of consecrating a reliquary for a thus-gone one.

source: ལམ་ལ་ཞུགས་པའི་ཤེས་རབ་ཀྱི་དབང་པོ་དང་ལྡན་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is discipline endowed with the power of insight of one who has embarked on the path.

source: ཡང་དག་པའི་མཐའ་ལས་ངེས་པར་བྱུང་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of deliverance by means of the limit of reality.

source: གཟུགས་ཀྱི་འདུ་ཤེས་རྣམ་པར་བཤིག་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence that destroys notions of form.
